app/Controllers/Amenities.php

SELECT *
FROM `tbl_amenities`
 LIMIT 2, 2
SELECT COUNT(*) AS `numrows`
FROM `tbl_amenities`
SELECT *
FROM `tbl_contact`
---
  public function display_amenities()
  {
    $amenities = new AmenitiesModel();
    $pager = \Config\Services::pager();
    $data = [
          'details' => $amenities->paginate(2),
          'pager' => $amenities->pager,
      ];

    $contact = new ContactModel();
    $data['contact'] = $contact->findAll();