app/Controllers/Trainer.php

SELECT *
FROM `tbl_trainers`
 LIMIT 2, 2
SELECT COUNT(*) AS `numrows`
FROM `tbl_trainers`
SELECT *
FROM `tbl_contact`
---
  public function show()
  {
    $pager = \Config\Services::pager();

    $trainermodel = new TrainerModel();
    $trainer_data = [
          'trainer' => $trainermodel->paginate(2),
          'pager' => $trainermodel->pager,
      ];

    $data['user_data'] = session()->get();
    $contact = new ContactModel();
    $data['contact']  = $contact->findAll();